package githubcode;

public class code {

	public static void main(String[] args) {

		
		// 깃허브 기본개념
		/**
		 * 1, Repository : 저장소를 뜻하며 파일과 변경 이력을 저장하는 곳, 개인 프로젝트는 로컬저장소에, 협업 프로젝트는 원격 저장소에 저장
		 * 2, Commit : 코드나 파일의 변경 사항을 기록하는 작업.
		 * 3, Branch : 독립적인 작업 공간, 여러 브런치는 만들어서 서로 다른 작없을 동시에 할수있다.
		 * 4, Merge : 서로 다른 브랜치의 작업을 합친다.
		 * 5, Clone : 원격 저장소를 내 컴퓨터로 복사
		 * 6, Push : 로컬에 작업한 내용을 원격 저장소에 올린다.
		 * 7, Pull : 원격 저장소의 내용을 로컬 저장소로 가져온다.
		 */
		
		// 기본 명령어
		/**
		 * 1, git init : 새로운 저장소 초기화
		 * 2, git status : 현재 상태 확인 (변경파일확인, 커밋안된파일 확인)
		 * 3, git add 파일명 : 변경된 파일을 스테이징 영역에 추가
		 * 4, git commit - m "메세지" : 커밋을 생성하고 메시지를 추가
		 * 5, git push : 변경사항을 원격 저장소에 업로드
		 * 6, git pull : 원격 저장소의 변경내용을 로컬 저장소로 가져온다.
		 * 7, git clone 파일경로 : 원격저장소를 로컬로 복제한다.
		 */
	}

}
